export const majorOptions = [
  {
    title: '소프트웨어융합대학',
    items: [
      { key: '인공지능공학과', value: '인공지능공학과' },
      { key: '데이터사이언스학과', value: '데이터사이언스학과' },
      { key: '스마트모빌리티공학과', value: '스마트모빌리티공학과' },
      { key: '디자인테크놀로지학과', value: '디자인테크놀로지학과' },
      { key: '컴퓨터공학과', value: '컴퓨터공학과' },
    ],
  },
  {
    title: '프런티어창의대학',
    items: [
      { key: '자유전공융합학부', value: '자유전공융합학부' },
      { key: '공학융합학부', value: '공학융합학부' },
      { key: '자연과학융합학부', value: '자연과학융합학부' },
      { key: '경영융합학부', value: '경영융합학부' },
      { key: '사회과학융합학부', value: '사회과학융합학부' },
      { key: '인문융합학부', value: '인문융합학부' },
    ],
  },
  {
    title: '바이오시스템융합학부',
    items: [
      { key: '생명공학과', value: '생명공학과' },
      { key: '생명과학과', value: '생명과학과' },
      { key: '첨단바이오의약학과', value: '첨단바이오의약학과' },
    ],
  },
  {
    title: '공과대학',
    items: [
      { key: '기계공학과', value: '기계공학과' },
      { key: '항공우주공학과', value: '항공우주공학과' },
      { key: '조선해양공학과', value: '조선해양공학과' },
      { key: '산업경영공학과', value: '산업경영공학과' },
      { key: '화학공학과', value: '화학공학과' },
      { key: '고분자공학과', value: '고분자공학과' },
      { key: '신소재공학과', value: '신소재공학과' },
      { key: '사회인프라공학과', value: '사회인프라공학과' },
      { key: '환경공학과', value: '환경공학과' },
      { key: '공간정보공학과', value: '공간정보공학과' },
      { key: '건축공학전공', value: '건축공학전공' },
      { key: '건축학전공(5년제)', value: '건축학전공(5년제)' },
      { key: '에너지자원공학과', value: '에너지자원공학과' },
      { key: '전기전자공학부', value: '전기전자공학부' },
      { key: '반도체시스템공학과', value: '반도체시스템공학과' },
      { key: '이차전지융합학과', value: '이차전지융합학과' },
    ],
  },
  {
    title: '자연과학대학',
    items: [
      { key: '수학과', value: '수학과' },
      { key: '통계학과', value: '통계학과' },
      { key: '물리학과', value: '물리학과' },
      { key: '화학과', value: '화학과' },
      { key: '해양과학과', value: '해양과학과' },
      { key: '식품영양학과', value: '식품영양학과' },
    ],
  },
  {
    title: '경영대학',
    items: [
      { key: '경영학과', value: '경영학과' },
      { key: '파이낸스경영학과', value: '파이낸스경영학과' },
      { key: '아태물류학부', value: '아태물류학부' },
      { key: '국제통상학과', value: '국제통상학과' },
    ],
  },
  {
    title: '사범대학',
    items: [
      { key: '국어교육과', value: '국어교육과' },
      { key: '영어교육과', value: '영어교육과' },
      { key: '사회교육과', value: '사회교육과' },
      { key: '체육교육과', value: '체육교육과' },
      { key: '교육학과', value: '교육학과' },
      { key: '수학교육과', value: '수학교육과' },
    ],
  },
  {
    title: '사회과학대학',
    items: [
      { key: '행정학과', value: '행정학과' },
      { key: '정치외교학과', value: '정치외교학과' },
      { key: '경제학과', value: '경제학과' },
      { key: '소비자학과', value: '소비자학과' },
      { key: '아동심리학과', value: '아동심리학과' },
      { key: '사회복지학과', value: '사회복지학과' },
      { key: '미디어커뮤니케이션학과', value: '미디어커뮤니케이션학과' },
    ],
  },
  {
    title: '문과대학',
    items: [
      { key: '한국어문학과', value: '한국어문학과' },
      { key: '사학과', value: '사학과' },
      { key: '철학과', value: '철학과' },
      { key: '중국학과', value: '중국학과' },
      { key: '일본언어문화학과', value: '일본언어문화학과' },
      { key: '영미유럽인문융합학부', value: '영미유럽인문융합학부' },
      { key: '문화콘텐츠문화경영학과', value: '문화콘텐츠문화경영학과' },
    ],
  },
  {
    title: '의과대학',
    items: [
      { key: '의예과', value: '의예과' },
    ],
  },
  {
    title: '간호대학',
    items: [
      { key: '간호학과', value: '간호학과' },
    ],
  },
  {
    title: '예술체육대학',
    items: [
      { key: '조형예술학과', value: '조형예술학과' },
      { key: '스포츠과학과', value: '스포츠과학과' },
      { key: '의류디자인학과', value: '의류디자인학과' },
      { key: '디자인융합학과', value: '디자인융합학과' },
      { key: '연극영화학과', value: '연극영화학과' },
    ],
  },
  {
    title: '미래융합대학',
    items: [
      { key: '메카트로닉스공학과', value: '메카트로닉스공학과' },
      { key: '산업경영학과', value: '산업경영학과' },
      { key: '반도체산업융합학과', value: '반도체산업융합학과' },
      { key: '소프트웨어융합공학과', value: '소프트웨어융합공학과' },
      { key: '금융투자학과', value: '금융투자학과' },
    ],
  },
] as const;
